{"abarbeiten": 0, "abgerutscht": 1, "abgestuft": 2, "abhaengt": 3, "abhalten": 4, "ablauf": 5, "abs": 6, "abschluss": 7, "abschreibung": 8, "abschwaechen": 9, "abstimmung": 10, "adressieren": 11, "aeussern": 12, "aktie": 13, "aktienkurs": 14, "aktienrueckkauf": 15, "aktienrueckkaufprogramm": 16, "aktionaere": 17, "amt": 18, "amtszeit": 19, "analysehaus": 20, "analyst": 21, "analystin": 22, "anbelangen": 23, "anbieter": 24, "angabe": 25, "angebots": 26, "angriffskrieg": 27, "anheben": 28, "ankommen": 29, "anleger": 30, "annahme": 31, "anstieg": 32, "anteilsschein": 33, "april": 34, "arbeiten": 35, "arbeitsfaehigkeit": 36, "architektur": 37, "art": 38, "atomkraft": 39, "aufholen": 40, "aufloese": 41, "aufnehmen": 42, "aufsichtsgremium": 43, "aufsichtsrat": 44, "aufsichtsratsvorsitzender": 45, "aufwaende": 46, "ausbauen": 47, "ausblick": 48, "ausgabe": 49, "ausliefern": 50, "ausnutzung": 51, "aussage": 52, "ausscheiden": 53, "ausschluss": 54, "ausschuettung": 55, "aussprechen": 56, "auswirkung": 57, "autozulieferer": 58, "bank": 59, "bareinlage": 60, "barkapitalerhoehung": 61, "basis": 62, "bau": 63, "bedenken": 64, "bedingen": 65, "befrieden": 66, "begriff": 67, "behafteen": 68, "beitrag": 69, "bekanntmachung": 70, "belassen": 71, "belasteen": 72, "belasten": 73, "belebung": 74, "beleihungsrisike": 75, "bereich": 76, "bericht": 77, "berichten": 78, "beruecksichtigen": 79, "beschleunigen": 80, "beschliessen": 81, "beschliesst": 82, "beschlie\u00dfen": 83, "beschluss": 84, "besetzung": 85, "bestaetigen": 86, "betonen": 87, "bezugsrecht": 88, "bezugsrechtsausschluss": 89, "billigflieger": 90, "bleiben": 91, "blicken": 92, "boerse": 93, "boersengang": 94, "bord": 95, "budgetplanung": 96, "buehne": 97, "chance": 98, "chef": 99, "chefin": 100, "chipindustrieausruester": 101, "cyberattacke": 102, "definition": 103, "demonstrieren": 104, "dienstag": 105, "dienstleister": 106, "digitalisierung": 107, "dividende": 108, "dividendenauszahlung": 109, "dollar": 110, "donnerstag": 111, "donnerstagabend": 112, "duerfen": 113, "e": 114, "ebit": 115, "ebitda": 116, "effizienz": 117, "eindaemmen": 118, "einnahme": 119, "einschaetzung": 120, "einstufung": 121, "elektrifizierung": 122, "elektrolyse": 123, "elektronikhaendler": 124, "empfehlen": 125, "endspurt": 126, "energie": 127, "energieeffizienz": 128, "energiekonzern": 129, "energiemanagement": 130, "engagement": 131, "entscheidung": 132, "entsprechen": 133, "entwickeln": 134, "entwicklung": 135, "entwicklungsmoeglichkeiten": 136, "erfolgen": 137, "ergeben": 138, "ergebnis": 139, "ergebnisentwicklung": 140, "erhoehen": 141, "erholung": 142, "erlaeutern": 143, "ernten": 144, "erreichen": 145, "ersetzen": 146, "erwarten": 147, "erwartung": 148, "erwerb": 149, "euro": 150, "ex": 151, "fahrer": 152, "fahrzeug": 153, "feuern": 154, "finanz": 155, "finanzchef": 156, "finanzkennzahle": 157, "finanzvorstand": 158, "firmensitz": 159, "fliessen": 160, "flueg": 161, "fluegelspieler": 162, "flugverkehr": 163, "forschung": 164, "fortfuehren": 165, "freitag": 166, "freitagabend": 167, "fruecht": 168, "fuehren": 169, "fuehrn": 170, "fuehrungsmannschaft": 171, "fuehrungsstreit": 172, "fuehrungswechsel": 173, "fuer": 174, "funktion": 175, "fussball": 176, "gang": 177, "geben": 178, "gem": 179, "genehmigt": 180, "gesamtjahr": 181, "gesamtjahresprognose": 182, "gesamtrendite": 183, "geschaeft": 184, "geschaeftsbericht": 185, "geschaeftsergebniss": 186, "geschaeftsjahr": 187, "geschaeftsquartal": 188, "gesellschaft": 189, "gesellschafterin": 190, "gesellschafterrat": 191, "gewinnausblick": 192, "gewinnen": 193, "gewinnrueckgang": 194, "gewinnspanne": 195, "gewinnwachstum": 196, "gitten": 197, "grossauftrag": 198, "gruenden": 199, "grundkapital": 200, "haeln": 201, "halbjahr": 202, "halbleiterloesunge": 203, "handelsplattform": 204, "hauptstandort": 205, "hauptversammlung": 206, "herbst": 207, "herr": 208, "herrschen": 209, "herstellen": 210, "herstellung": 211, "hiess": 212, "hinlegen": 213, "hochgestuft": 214, "hoeh": 215, "hoehe": 216, "immobilienkonzern": 217, "immobilienwert": 218, "inflationsdruck": 219, "inhaber": 220, "innovationszentrum": 221, "internationalisierung": 222, "internetseite": 223, "investition": 224, "investmentbank": 225, "investor": 226, "jahr": 227, "jahresstart": 228, "jahresvergleich": 229, "jahresziel": 230, "januar": 231, "juli": 232, "juni": 233, "kacker": 234, "kapital": 235, "kapitalstaerk": 236, "kauf": 237, "kaufen": 238, "kgaa": 239, "koennen": 240, "kohlenstoffspezialist": 241, "kollege": 242, "kommandant": 243, "kommen": 244, "kommentar": 245, "kongress": 246, "konkurrent": 247, "konsensschaetzung": 248, "kontinuitaet": 249, "konzernebene": 250, "konzernfinanz": 251, "konzernumsatz": 252, "kosten": 253, "kraft": 254, "krankenhausdienstleister": 255, "kreditinstitut": 256, "kreis": 257, "kunde": 258, "kundenauftraege": 259, "kuratorium": 260, "kuratoriumsvorsitzende": 261, "kursziel": 262, "lasten": 263, "lebensmittel": 264, "leihbasis": 265, "leihgeschaeft": 266, "leisten": 267, "leistung": 268, "lieferkette": 269, "liefern": 270, "liegen": 271, "linie": 272, "loben": 273, "lohnkosten": 274, "maerkt": 275, "maerz": 276, "mai": 277, "mann": 278, "marge": 279, "margenziel": 280, "markt": 281, "marktumfeld": 282, "maschine": 283, "material": 284, "mdax": 285, "mediamarkt": 286, "megatrend": 287, "mehrheitsbeteiligung": 288, "meilenstein": 289, "meisterschaft": 290, "menue": 291, "milliarde": 292, "million": 293, "millionenstrafe": 294, "minus": 295, "mio": 296, "mitarbeiteranzahl": 297, "mitglied": 298, "mitte": 299, "mitteilen": 300, "mitteilung": 301, "mittwoch": 302, "mittwochvormittag": 303, "monat": 304, "montag": 305, "mutterkonzern": 306, "nachfrage": 307, "nachhaltigkeitseffekt": 308, "naehern": 309, "nehmen": 310, "nettozinseinnahme": 311, "neumueller": 312, "niveau": 313, "nostemedia": 314, "notieren": 315, "nr": 316, "nutzfahrzeugzulieferer": 317, "octapharma": 318, "offensivspieler": 319, "offerte": 320, "oktober": 321, "online": 322, "organisation": 323, "outperform": 324, "overweight": 325, "papier": 326, "partizipieren": 327, "partner": 328, "peilen": 329, "perform": 330, "personal": 331, "personalaufbau": 332, "personalaufwand": 333, "pfund": 334, "pharma": 335, "pharmahersteller": 336, "planen": 337, "plattformentwicklung": 338, "platz": 339, "position": 340, "posten": 341, "preis": 342, "produkt": 343, "produktentwicklung": 344, "produktgeneration": 345, "profitabilitaet": 346, "profiteur": 347, "profitieren": 348, "prognose": 349, "prognoseanhebung": 350, "prozent": 351, "quartal": 352, "quartalsbericht": 353, "quartalsgewinn": 354, "quartalszahle": 355, "rahmen": 356, "reaktion": 357, "rechnen": 358, "rede": 359, "reduzieren": 360, "reing": 361, "reiseverkehr": 362, "reissen": 363, "rekord": 364, "rekordjahr": 365, "relation": 366, "resultat": 367, "richtschuetze": 368, "rolle": 369, "ruder": 370, "rueckgang": 371, "rueckkehr": 372, "ruecktritt": 373, "ruestungskonzer": 374, "sacken": 375, "sancho": 376, "sanktionsverstoesse": 377, "schaffen": 378, "schlusskurs": 379, "schlussquartal": 380, "schreiben": 381, "schrumpfen": 382, "schuesse": 383, "schuetzenpanzer": 384, "schuetzentrupp": 385, "sdax": 386, "sender": 387, "senken": 388, "senkung": 389, "situation": 390, "sitzen": 391, "software": 392, "solvabilitaetsquote": 393, "sommer": 394, "sondereffekt": 395, "sonderfracht": 396, "sonderpreis": 397, "spanne": 398, "sparte": 399, "spekulieren": 400, "spezialist": 401, "spielen": 402, "sprechen": 403, "stabilisierung": 404, "standort": 405, "start": 406, "starten": 407, "stehen": 408, "steigen": 409, "steigern": 410, "stellen": 411, "sterben": 412, "steuer": 413, "stiftung": 414, "stimmen": 415, "stimmung": 416, "strafe": 417, "streik": 418, "streitthema": 419, "studie": 420, "stueckaktie": 421, "system": 422, "tabakprodukt": 423, "tagesgeschaeft": 424, "tarifdeal": 425, "tarifstreit": 426, "technologiekonzern": 427, "teilen": 428, "thema": 429, "ticketpreis": 430, "tiefgestapelt": 431, "todesschuetz": 432, "tragen": 433, "trend": 434, "tv": 435, "typ": 436, "uebernahm": 437, "uebernahme": 438, "uebernahmeangebot": 439, "uebernehme": 440, "uebernommen": 441, "ueberraschen": 442, "uebertreffen": 443, "ueberworfen": 444, "ueberzeugt": 445, "umfang": 446, "umfeld": 447, "umsaetze": 448, "umsatz": 449, "umsatzanstieg": 450, "umsatzausfall": 451, "umsatzdynamik": 452, "umsatzerloese": 453, "umsatzwachstum": 454, "umschalten": 455, "umstrukturierung": 456, "umstrukturierungs": 457, "underweight": 458, "unsicherheit": 459, "unternehmen": 460, "unternehmensziele": 461, "unterstreichen": 462, "verabschieden": 463, "verbessern": 464, "verbesserung": 465, "verbindungshalbleiter": 466, "verbindungstechnik": 467, "verbleiben": 468, "verbuchen": 469, "verdeutlichten": 470, "verdienen": 471, "vergangenheit": 472, "vergleich": 473, "verhaengt": 474, "verkauf": 475, "verkaufen": 476, "verlauf": 477, "verlust": 478, "vermiesen": 479, "vernichten": 480, "veroeffentlich": 481, "veroeffentlichen": 482, "verordnung": 483, "verschieben": 484, "vertreten": 485, "vertrieb": 486, "vertriebseinheit": 487, "verweisen": 488, "verzeichnen": 489, "verzichten": 490, "viertel": 491, "volocopter": 492, "vorgabe": 493, "vorjahreszeitraum": 494, "vorlegen": 495, "vorschlag": 496, "vorschlagen": 497, "vorsitzend": 498, "vorstand": 499, "vorstandschef": 500, "vorstandsvorsitzender": 501, "vorsteuergewinn": 502, "vortag": 503, "wachsen": 504, "wachstum": 505, "wachstumsdynamik": 506, "wachstumskurs": 507, "wachstumsmodus": 508, "wachstumsprogramm": 509, "waehlen": 510, "waehrungs": 511, "waeren": 512, "warnen": 513, "wasserstoff": 514, "wechsel": 515, "wechseln": 516, "weisen": 517, "welt": 518, "werk": 519, "werksgelaende": 520, "wiederwahl": 521, "wirkung": 522, "woche": 523, "xetra": 524, "youngster": 525, "zahl": 526, "zahlen": 527, "zeitarbeitskraefte": 528, "zeitraum": 529, "zeitung": 530, "ziel": 531, "zigarettenkonzer": 532, "zins": 533, "zulegen": 534, "zurueckgingen": 535, "zurueckkehren": 536, "zuruecktreten": 537, "zurueckzufuehren": 538, "zusatzschichte": 539, "zustimmung": 540, "zwischenmeldung": 541}